'''
Задача №337. Сумма цифр
Выведите сумму цифр числа x.
'''
print(sum([int(a) for a in input()]))

