'''
Задача №342. Сумма ста
Вычислите сумму данных 100 натуральных чисел.
'''
sumi = 0
for i in range(100):
    sumi += int(input())
print(sumi)