'''
Задача №344. Перевод числа
Переведите натуральное число из двоичной системы в десятичную (в двоичном числе не более 10 цифр).
'''
print(int(input(), 2))

