'''
Задача №292. Максимум из двух чисел
Ввод и вывод данных производятся через стандартные потоки ввода-вывода.
'''
a, b = int(input()), int(input())
print(a if a > b else b)