'''
Задача №2937. Следующее и предыдущее
Напишите программу, которая считывает целое число и выводит текст, аналогичный приведенному
в примере. Пробелы, знаки препинания, заглавные и строчные буквы важны!
'''

n = int(input())
print(f'The next number for the number {n} is {n + 1}.')
print(f'The previous number for the number {n} is {n - 1}.')